[
    {
        "Modification": "Replace the existing bathtub/shower combination with a curbless (zero-entry) shower stall. Ensure the new shower floor is a high-traction, non-slip surface.",
        "Rationale": "Eliminates the need to step over the high tub wall, which is a significant trip and fall hazard for individuals with mobility and balance impairments. A zero-entry design allows for easier access, including potential roll-in access for wheeled mobility devices, aligning with universal design principles and drastically reducing fall risk during bathing entry/exit (ADA principle: Accessible Routes)."
    },
    {
        "Modification": "Install multiple grab bars within the bathing area: a vertical grab bar at the shower entry, a horizontal grab bar along the back wall, and another horizontal or angled grab bar on the control wall.",
        "Rationale": "Provides crucial support points for stability when entering, exiting, maneuvering, and standing within the shower/tub area. This directly addresses balance issues and helps prevent falls, a key aspect of accessible design and aging-in-place safety (ADA principle: Stability and Support)."
    },
    {
        "Modification": "Install grab bars around the toilet: one horizontal grab bar on the rear wall behind the toilet and one horizontal or L-shaped grab bar on the side wall closest to the toilet (typically the wall between the toilet and tub).",
        "Rationale": "Assists with safe transfers on and off the toilet (sitting down and standing up), which can be challenging for individuals with weakness or balance problems. Properly placed grab bars provide necessary leverage and support, reducing the risk of falls during toileting (ADA principle: Stability and Support)."
    },
    {
        "Modification": "Install a wall-mounted, fold-down shower seat within the bathing area, positioned at an ADA-compliant height (typically 17-19 inches from the floor).",
        "Rationale": "Allows the resident to sit while showering, conserving energy, reducing fatigue, and significantly lowering the risk of falls caused by balance loss while standing on a wet surface. Ensures stability during bathing for those who cannot stand safely for extended periods (ADA principle: Seating in Bathing Facilities)."
    },
    {
        "Modification": "Replace the fixed shower head with a handheld shower head mounted on an adjustable vertical slide bar. Ensure controls are easily reachable from both seated and standing positions and consider lever-style, pressure-balanced, anti-scald faucet controls.",
        "Rationale": "A handheld shower head on a slide bar allows bathing while seated and directs water where needed without requiring difficult movements or standing. Easy-to-operate, anti-scald controls prevent burns and are usable by individuals with limited hand strength or dexterity (ADA principles: Reach Ranges, Operable Parts)."
    }
]